import java.util.Scanner;

public class SEVEN {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);










    }
}

//Изчисляваме обем на аквариум:
//обем на аквариум= 85*75*47=299625 см3
//общо литри, които ще събере: 299625 * 0.001=299.625 литра
//процент: 17*0.01=0.17
//литрите, които реално ще трябват : 299.625*(1-0.17) = 248.68875 литра

//1.	Дължина в см – цяло число в интервала [10 … 500]
//2.	Широчина в см – цяло число в интервала [10 … 300]
//3.	Височина в см – цяло число в интервала [10… 200]
//4.	Процент  – реално число в интервала [0.000 … 100.000]

//6.	Създайте четири променливи с подходящо име и тип, които записват вход от конзолата – реални и цели числа – aquariumLength, aquariumWidth, aquariumHeigth, sandPercent
//7.	Създайте още една променлива, която записва резултата за обема на аквариума - aquariumVolume
//8.	Изчислете обема на аквариума в дециметри
//9.	Изчислете обема, който заемат принадлежностите за аквариума - aquariumAttributesVolume
//10.	Накрая създайте още една променлива, която записва литрите, които реално ще трябват след като извадите обема на принадлежностите за аквариума от общия му обем
//11.	Изведете резултата на конзолата, като форматирате до третия знак след десетичната запетая, използвайки шаблона %.3f
