n = int(input())
p1 = 0
p2 = 0
p3 = 0
p4 = 0
p5 = 0

for i in range(n):
    number = int(input())
    if number < 200:
        p1 += 1  # тук ще събирам броя пъти в които аз съм срещнал число в този диапазон, защото аз накрая трябва да
    # търся процента
    # Вътре в този цикък аз ще чета едно число и ще проверявам в кой диапазон той се намира
# Преди да стигна до цикъла имам  п1 п2 ... са едни променливи които аз ще си запазвам колко на брой пъти аз съм срещнал
# число от съответния диапазон дали е <200 и тн.
# => си създавам p1=0,  защото ne sym go срещал do sega w съответния диапазон
    elif number <= 399:
        p2 += 1
    elif number <= 599:
        p3 += 1
    elif number <= 799:
        p4 += 1
    elif number >= 800:  # else
        p5 += 1
print(f"{p1 / n * 100:.2f}%")
print(f"{p2 / n * 100:.2f}%")
print(f"{p3 / n * 100:.2f}%")
print(f"{p4 / n * 100:.2f}%")
print(f"{p5 / n * 100:.2f}%")


